resource/template/simpleFoamExternal/0/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 2.0;
Zref                 4;
zDir                 (0 0 1);
flowDir              (0 -1 0);
z0                   uniform 0.0;
zGround              uniform 0.0;
value                $internalField;

// ************************************************************************* //
