resource/template/simpleFoamExternal/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

include                 "initialConditions";

dimensions              [0 2 -3 0 0 0 0];

internalField           uniform $turbulentEpsilon;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        include         "ABLConditions";
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentEpsilon;
        value           $internalField;
    }

    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
